Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpe100.h
extern volatile __EEADDRbits_t EEADDRbits __asm__ ("EEADDR") __attribute__((section("sfrs"), address(0xBF829020)));
extern volatile uint32_t        EEADDRCLR __attribute__((section("sfrs"),address(0xBF829024)));
extern volatile uint32_t        EEADDRSET __attribute__((section("sfrs"),address(0xBF829028)));
extern volatile uint32_t        EEADDRINV __attribute__((section("sfrs"),address(0xBF82902C)));
#define EEDATA EEDATA
extern volatile uint32_t   EEDATA __attribute__((section("sfrs"), address(0xBF829030)));
extern volatile uint32_t        EEDATACLR __attribute__((section("sfrs"),address(0xBF829034)));
extern volatile uint32_t        EEDATASET __attribute__((section("sfrs"),address(0xBF829038)));
extern volatile uint32_t        EEDATAINV __attribute__((section("sfrs"),address(0xBF82903C)));
#define CMSTAT CMSTAT
extern volatile uint32_t   CMSTAT __attribute__((section("sfrs"), address(0xBF82C000)));
typedef struct {
  uint32_t C1OUT:1;
  uint32_t C2OUT:1;
  uint32_t C3OUT:1;
  uint32_t C4OUT:1;
  uint32_t C5OUT:1;
  uint32_t :8;
  uint32_t SIDL:1;
  uint32_t :2;
  uint32_t C1EVT:1;
  uint32_t C2EVT:1;
  uint32_t C3EVT:1;
  uint32_t C4EVT:1;
  uint32_t C5EVT:1;
} __CMSTATbits_t;
extern volatile __CMSTATbits_t CMSTATbits __asm__ ("CMSTAT") __attribute__((section("sfrs"), address(0xBF82C000)));
extern volatile uint32_t        CMSTATCLR __attribute__((section("sfrs"),address(0xBF82C004)));
extern volatile uint32_t        CMSTATSET __attribute__((section("sfrs"),address(0xBF82C008)));
extern volatile uint32_t        CMSTATINV __attribute__((section("sfrs"),address(0xBF82C00C)));
#define CM1CON CM1CON
extern volatile uint32_t   CM1CON __attribute__((section("sfrs"), address(0xBF82C010)));
typedef struct {
  uint32_t CCH:2;
  uint32_t :2;
  uint32_t CREF:1;
  uint32_t :1;
  uint32_t EVPOL:2;
  uint32_t COUT:1;
  uint32_t CEVT:1;
  uint32_t AMPMOD:1;
  uint32_t OAO:1;
  uint32_t :1;
  uint32_t CPOL:1;
  uint32_t COE:1;
  uint32_t ON:1;
  uint32_t CFDIV:3;
  uint32_t CFLTREN:1;
  uint32_t CFSEL:3;
} __CM1CONbits_t;
extern volatile __CM1CONbits_t CM1CONbits __asm__ ("CM1CON") __attribute__((section("sfrs"), address(0xBF82C010)));
extern volatile uint32_t        CM1CONCLR __attribute__((section("sfrs"),address(0xBF82C014)));
extern volatile uint32_t        CM1CONSET __attribute__((section("sfrs"),address(0xBF82C018)));
extern volatile uint32_t        CM1CONINV __attribute__((section("sfrs"),address(0xBF82C01C)));
#define CM2CON CM2CON
extern volatile uint32_t   CM2CON __attribute__((section("sfrs"), address(0xBF82C030)));
typedef struct {
  uint32_t CCH:2;
  uint32_t :2;
  uint32_t CREF:1;
  uint32_t :1;
  uint32_t EVPOL:2;
  uint32_t COUT:1;
  uint32_t CEVT:1;
  uint32_t AMPMOD:1;
  uint32_t OAO:1;
  uint32_t :1;
  uint32_t CPOL:1;
  uint32_t COE:1;
  uint32_t ON:1;
  uint32_t CFDIV:3;
  uint32_t CFLTREN:1;
  uint32_t CFSEL:3;
} __CM2CONbits_t;
extern volatile __CM2CONbits_t CM2CONbits __asm__ ("CM2CON") __attribute__((section("sfrs"), address(0xBF82C030)));
extern volatile uint32_t        CM2CONCLR __attribute__((section("sfrs"),address(0xBF82C034)));
extern volatile uint32_t        CM2CONSET __attribute__((section("sfrs"),address(0xBF82C038)));
extern volatile uint32_t        CM2CONINV __attribute__((section("sfrs"),address(0xBF82C03C)));
#define CM3CON CM3CON
extern volatile uint32_t   CM3CON __attribute__((section("sfrs"), address(0xBF82C050)));
typedef struct {
  uint32_t CCH:2;
  uint32_t :2;
  uint32_t CREF:1;
  uint32_t :1;
  uint32_t EVPOL:2;
  uint32_t COUT:1;
  uint32_t CEVT:1;
  uint32_t AMPMOD:1;
  uint32_t OAO:1;
  uint32_t :1;
  uint32_t CPOL:1;
  uint32_t COE:1;
  uint32_t ON:1;
  uint32_t CFDIV:3;
  uint32_t CFLTREN:1;
  uint32_t CFSEL:3;
} __CM3CONbits_t;
extern volatile __CM3CONbits_t CM3CONbits __asm__ ("CM3CON") __attribute__((section("sfrs"), address(0xBF82C050)));
extern volatile uint32_t        CM3CONCLR __attribute__((section("sfrs"),address(0xBF82C054)));
extern volatile uint32_t        CM3CONSET __attribute__((section("sfrs"),address(0xBF82C058)));
extern volatile uint32_t        CM3CONINV __attribute__((section("sfrs"),address(0xBF82C05C)));
#define CM4CON CM4CON
extern volatile uint32_t   CM4CON __attribute__((section("sfrs"), address(0xBF82C070)));
typedef struct {
  uint32_t CCH:2;
  uint32_t :2;
  uint32_t CREF:1;
  uint32_t :1;
  uint32_t EVPOL:2;
  uint32_t COUT:1;
  uint32_t CEVT:1;
  uint32_t :1;
  uint32_t OAO:1;
  uint32_t :1;
  uint32_t CPOL:1;
  uint32_t COE:1;
  uint32_t ON:1;
  uint32_t CFDIV:3;
  uint32_t CFLTREN:1;
  uint32_t CFSEL:3;
} __CM4CONbits_t;
extern volatile __CM4CONbits_t CM4CONbits __asm__ ("CM4CON") __attribute__((section("sfrs"), address(0xBF82C070)));
extern volatile uint32_t        CM4CONCLR __attribute__((section("sfrs"),address(0xBF82C074)));
extern volatile uint32_t        CM4CONSET __attribute__((section("sfrs"),address(0xBF82C078)));
extern volatile uint32_t        CM4CONINV __attribute__((section("sfrs"),address(0xBF82C07C)));
#define CM5CON CM5CON
extern volatile uint32_t   CM5CON __attribute__((section("sfrs"), address(0xBF82C090)));
typedef struct {
  uint32_t CCH:2;
  uint32_t :2;
  uint32_t CREF:1;
  uint32_t :1;
  uint32_t EVPOL:2;
  uint32_t COUT:1;
  uint32_t CEVT:1;
  uint32_t AMPMOD:1;
  uint32_t OAO:1;
  uint32_t :1;
  uint32_t CPOL:1;
  uint32_t COE:1;
  uint32_t ON:1;
  uint32_t CFDIV:3;
  uint32_t CFLTREN:1;
  uint32_t CFSEL:3;
} __CM5CONbits_t;
extern volatile __CM5CONbits_t CM5CONbits __asm__ ("CM5CON") __attribute__((section("sfrs"), address(0xBF82C090)));
extern volatile uint32_t        CM5CONCLR __attribute__((section("sfrs"),address(0xBF82C094)));
extern volatile uint32_t        CM5CONSET __attribute__((section("sfrs"),address(0xBF82C098)));
extern volatile uint32_t        CM5CONINV __attribute__((section("sfrs"),address(0xBF82C09C)));
#define DAC1CON DAC1CON
extern volatile uint32_t   DAC1CON __attribute__((section("sfrs"), address(0xBF82C200)));
typedef struct {
  uint32_t REFSEL:2;
  uint32_t :6;
  uint32_t DACOE:1;
  uint32_t :6;
  uint32_t ON:1;
  uint32_t DACDAT:16;
} __DAC1CONbits_t;
extern volatile __DAC1CONbits_t DAC1CONbits __asm__ ("DAC1CON") __attribute__((section("sfrs"), address(0xBF82C200)));
extern volatile uint32_t        DAC1CONCLR __attribute__((section("sfrs"),address(0xBF82C204)));
extern volatile uint32_t        DAC1CONSET __attribute__((section("sfrs"),address(0xBF82C208)));
extern volatile uint32_t        DAC1CONINV __attribute__((section("sfrs"),address(0xBF82C20C)));
#define CTMUCON CTMUCON
extern volatile uint32_t   CTMUCON __attribute__((section("sfrs"), address(0xBF82D000)));
typedef union {
  struct {
    uint32_t IRNG:2;
    uint32_t ITRIM:6;
    uint32_t CTTRIG:1;
    uint32_t IDISSEN:1;
    uint32_t EDGSEQEN:1;
    uint32_t EDGEN:1;
    uint32_t TGEN:1;
    uint32_t CTMUSIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t :2;
    uint32_t EDG2SEL:4;
    uint32_t EDG2POL:1;
    uint32_t EDG2MOD:1;
    uint32_t EDG1STAT:1;
    uint32_t EDG2STAT:1;
    uint32_t EDG1SEL:4;
    uint32_t EDG1POL:1;
    uint32_t EDG1MOD:1;
  };
  struct {
    uint32_t w:32;
  };
} __CTMUCONbits_t;
extern volatile __CTMUCONbits_t CTMUCONbits __asm__ ("CTMUCON") __attribute__((section("sfrs"), address(0xBF82D000)));
extern volatile uint32_t        CTMUCONCLR __attribute__((section("sfrs"),address(0xBF82D004)));
extern volatile uint32_t        CTMUCONSET __attribute__((section("sfrs"),address(0xBF82D008)));
extern volatile uint32_t        CTMUCONINV __attribute__((section("sfrs"),address(0xBF82D00C)));
#define PMCON PMCON
extern volatile uint32_t   PMCON __attribute__((section("sfrs"), address(0xBF82E000)));
typedef union {
  struct {
    uint32_t RDSP:1;
    uint32_t WRSP:1;
    uint32_t :1;
    uint32_t CS1P:1;
    uint32_t CS2P:1;
    uint32_t ALP:1;
    uint32_t CSF:2;
    uint32_t PTRDEN:1;
    uint32_t PTWREN:1;
    uint32_t PMPTTL:1;
    uint32_t ADRMUX:2;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t EXADR:1;
    uint32_t DUALBUF:1;
    uint32_t :5;
    uint32_t RDSTART:1;
  };
  struct {
    uint32_t :6;
    uint32_t CSF0:1;
    uint32_t CSF1:1;
    uint32_t :3;
    uint32_t ADRMUX0:1;
    uint32_t ADRMUX1:1;
  };
  struct {
    uint32_t :13;
    uint32_t PSIDL:1;
    uint32_t :1;
    uint32_t PMPEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __PMCONbits_t;
extern volatile __PMCONbits_t PMCONbits __asm__ ("PMCON") __attribute__((section("sfrs"), address(0xBF82E000)));
extern volatile uint32_t        PMCONCLR __attribute__((section("sfrs"),address(0xBF82E004)));
extern volatile uint32_t        PMCONSET __attribute__((section("sfrs"),address(0xBF82E008)));
extern volatile uint32_t        PMCONINV __attribute__((section("sfrs"),address(0xBF82E00C)));
#define PMMODE PMMODE
extern volatile uint32_t   PMMODE __attribute__((section("sfrs"), address(0xBF82E010)));
typedef union {
  struct {
    uint32_t WAITE:2;
    uint32_t WAITM:4;
    uint32_t WAITB:2;
    uint32_t MODE:2;
    uint32_t MODE16:1;
    uint32_t INCM:2;
    uint32_t IRQM:2;
    uint32_t BUSY:1;
  };
  struct {
    uint32_t WAITE0:1;
    uint32_t WAITE1:1;
    uint32_t WAITM0:1;
    uint32_t WAITM1:1;
    uint32_t WAITM2:1;
    uint32_t WAITM3:1;
    uint32_t WAITB0:1;
    uint32_t WAITB1:1;
    uint32_t MODE0:1;
    uint32_t MODE1:1;
    uint32_t :1;
    uint32_t INCM0:1;
    uint32_t INCM1:1;
    uint32_t IRQM0:1;
    uint32_t IRQM1:1;
  };
  struct {
    uint32_t w:32;
  };
} __PMMODEbits_t;
extern volatile __PMMODEbits_t PMMODEbits __asm__ ("PMMODE") __attribute__((section("sfrs"), address(0xBF82E010)));
extern volatile uint32_t        PMMODECLR __attribute__((section("sfrs"),address(0xBF82E014)));
extern volatile uint32_t        PMMODESET __attribute__((section("sfrs"),address(0xBF82E018)));
extern volatile uint32_t        PMMODEINV __attribute__((section("sfrs"),address(0xBF82E01C)));
#define PMADDR PMADDR
extern volatile uint32_t   PMADDR __attribute__((section("sfrs"), address(0xBF82E020)));
typedef union {
  struct {
    uint32_t ADDR:14;
    uint32_t ADDR14:1;
    uint32_t ADDR15:1;
  };
  struct {
    uint32_t :14;
    uint32_t CS:2;
  };
  struct {
    uint32_t :14;
    uint32_t CS1:1;
    uint32_t CS2:1;
  };
  struct {
    uint32_t w:32;
  };
} __PMADDRbits_t;
extern volatile __PMADDRbits_t PMADDRbits __asm__ ("PMADDR") __attribute__((section("sfrs"), address(0xBF82E020)));
extern volatile uint32_t        PMADDRCLR __attribute__((section("sfrs"),address(0xBF82E024)));
extern volatile uint32_t        PMADDRSET __attribute__((section("sfrs"),address(0xBF82E028)));
extern volatile uint32_t        PMADDRINV __attribute__((section("sfrs"),address(0xBF82E02C)));
#define PMDOUT PMDOUT
extern volatile uint32_t   PMDOUT __attribute__((section("sfrs"), address(0xBF82E030)));
typedef union {
  struct {
    uint32_t DATAOUT:32;
  };
  struct {
    uint32_t w:32;
  };
} __PMDOUTbits_t;
extern volatile __PMDOUTbits_t PMDOUTbits __asm__ ("PMDOUT") __attribute__((section("sfrs"), address(0xBF82E030)));
extern volatile uint32_t        PMDOUTCLR __attribute__((section("sfrs"),address(0xBF82E034)));
extern volatile uint32_t        PMDOUTSET __attribute__((section("sfrs"),address(0xBF82E038)));
extern volatile uint32_t        PMDOUTINV __attribute__((section("sfrs"),address(0xBF82E03C)));
#define PMDIN PMDIN
extern volatile uint32_t   PMDIN __attribute__((section("sfrs"), address(0xBF82E040)));
typedef union {
  struct {
    uint32_t DATAIN:32;
  };
  struct {
    uint32_t w:32;
  };
} __PMDINbits_t;
extern volatile __PMDINbits_t PMDINbits __asm__ ("PMDIN") __attribute__((section("sfrs"), address(0xBF82E040)));
extern volatile uint32_t        PMDINCLR __attribute__((section("sfrs"),address(0xBF82E044)));
extern volatile uint32_t        PMDINSET __attribute__((section("sfrs"),address(0xBF82E048)));
extern volatile uint32_t        PMDININV __attribute__((section("sfrs"),address(0xBF82E04C)));
#define PMAEN PMAEN
extern volatile uint32_t   PMAEN __attribute__((section("sfrs"), address(0xBF82E050)));
typedef union {
  struct {
    uint32_t PTEN:24;
  };
  struct {
    uint32_t w:32;
  };
} __PMAENbits_t;
