Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpe100.h
extern volatile __C3FIFOCI2bits_t C3FIFOCI2bits __asm__ ("C3FIFOCI2") __attribute__((section("sfrs"), address(0xBF884400)));
extern volatile uint32_t        C3FIFOCI2CLR __attribute__((section("sfrs"),address(0xBF884404)));
extern volatile uint32_t        C3FIFOCI2SET __attribute__((section("sfrs"),address(0xBF884408)));
extern volatile uint32_t        C3FIFOCI2INV __attribute__((section("sfrs"),address(0xBF88440C)));
#define C3FIFOCON3 C3FIFOCON3
extern volatile uint32_t   C3FIFOCON3 __attribute__((section("sfrs"), address(0xBF884410)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCON3bits_t;
extern volatile __C3FIFOCON3bits_t C3FIFOCON3bits __asm__ ("C3FIFOCON3") __attribute__((section("sfrs"), address(0xBF884410)));
extern volatile uint32_t        C3FIFOCON3CLR __attribute__((section("sfrs"),address(0xBF884414)));
extern volatile uint32_t        C3FIFOCON3SET __attribute__((section("sfrs"),address(0xBF884418)));
extern volatile uint32_t        C3FIFOCON3INV __attribute__((section("sfrs"),address(0xBF88441C)));
#define C3FIFOINT3 C3FIFOINT3
extern volatile uint32_t   C3FIFOINT3 __attribute__((section("sfrs"), address(0xBF884420)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOINT3bits_t;
extern volatile __C3FIFOINT3bits_t C3FIFOINT3bits __asm__ ("C3FIFOINT3") __attribute__((section("sfrs"), address(0xBF884420)));
extern volatile uint32_t        C3FIFOINT3CLR __attribute__((section("sfrs"),address(0xBF884424)));
extern volatile uint32_t        C3FIFOINT3SET __attribute__((section("sfrs"),address(0xBF884428)));
extern volatile uint32_t        C3FIFOINT3INV __attribute__((section("sfrs"),address(0xBF88442C)));
#define C3FIFOUA3 C3FIFOUA3
extern volatile uint32_t   C3FIFOUA3 __attribute__((section("sfrs"), address(0xBF884430)));
extern volatile uint32_t        C3FIFOUA3CLR __attribute__((section("sfrs"),address(0xBF884434)));
extern volatile uint32_t        C3FIFOUA3SET __attribute__((section("sfrs"),address(0xBF884438)));
extern volatile uint32_t        C3FIFOUA3INV __attribute__((section("sfrs"),address(0xBF88443C)));
#define C3FIFOCI3 C3FIFOCI3
extern volatile uint32_t   C3FIFOCI3 __attribute__((section("sfrs"), address(0xBF884440)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCI3bits_t;
extern volatile __C3FIFOCI3bits_t C3FIFOCI3bits __asm__ ("C3FIFOCI3") __attribute__((section("sfrs"), address(0xBF884440)));
extern volatile uint32_t        C3FIFOCI3CLR __attribute__((section("sfrs"),address(0xBF884444)));
extern volatile uint32_t        C3FIFOCI3SET __attribute__((section("sfrs"),address(0xBF884448)));
extern volatile uint32_t        C3FIFOCI3INV __attribute__((section("sfrs"),address(0xBF88444C)));
#define C3FIFOCON4 C3FIFOCON4
extern volatile uint32_t   C3FIFOCON4 __attribute__((section("sfrs"), address(0xBF884450)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCON4bits_t;
extern volatile __C3FIFOCON4bits_t C3FIFOCON4bits __asm__ ("C3FIFOCON4") __attribute__((section("sfrs"), address(0xBF884450)));
extern volatile uint32_t        C3FIFOCON4CLR __attribute__((section("sfrs"),address(0xBF884454)));
extern volatile uint32_t        C3FIFOCON4SET __attribute__((section("sfrs"),address(0xBF884458)));
extern volatile uint32_t        C3FIFOCON4INV __attribute__((section("sfrs"),address(0xBF88445C)));
#define C3FIFOINT4 C3FIFOINT4
extern volatile uint32_t   C3FIFOINT4 __attribute__((section("sfrs"), address(0xBF884460)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOINT4bits_t;
extern volatile __C3FIFOINT4bits_t C3FIFOINT4bits __asm__ ("C3FIFOINT4") __attribute__((section("sfrs"), address(0xBF884460)));
extern volatile uint32_t        C3FIFOINT4CLR __attribute__((section("sfrs"),address(0xBF884464)));
extern volatile uint32_t        C3FIFOINT4SET __attribute__((section("sfrs"),address(0xBF884468)));
extern volatile uint32_t        C3FIFOINT4INV __attribute__((section("sfrs"),address(0xBF88446C)));
#define C3FIFOUA4 C3FIFOUA4
extern volatile uint32_t   C3FIFOUA4 __attribute__((section("sfrs"), address(0xBF884470)));
extern volatile uint32_t        C3FIFOUA4CLR __attribute__((section("sfrs"),address(0xBF884474)));
extern volatile uint32_t        C3FIFOUA4SET __attribute__((section("sfrs"),address(0xBF884478)));
extern volatile uint32_t        C3FIFOUA4INV __attribute__((section("sfrs"),address(0xBF88447C)));
#define C3FIFOCI4 C3FIFOCI4
extern volatile uint32_t   C3FIFOCI4 __attribute__((section("sfrs"), address(0xBF884480)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C3FIFOCI4bits_t;
