Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpe100.h
#define _IPC12_CNFIS_POSITION                    0x00000008
#define _IPC12_CNFIS_MASK                        0x00000300
#define _IPC12_CNFIS_LENGTH                      0x00000002

#define _IPC12_CNFIP_POSITION                    0x0000000A
#define _IPC12_CNFIP_MASK                        0x00001C00
#define _IPC12_CNFIP_LENGTH                      0x00000003

#define _IPC12_CNGIS_POSITION                    0x00000010
#define _IPC12_CNGIS_MASK                        0x00030000
#define _IPC12_CNGIS_LENGTH                      0x00000002

#define _IPC12_CNGIP_POSITION                    0x00000012
#define _IPC12_CNGIP_MASK                        0x001C0000
#define _IPC12_CNGIP_LENGTH                      0x00000003

#define _IPC12_PMPIS_POSITION                    0x00000018
#define _IPC12_PMPIS_MASK                        0x03000000
#define _IPC12_PMPIS_LENGTH                      0x00000002

#define _IPC12_PMPIP_POSITION                    0x0000001A
#define _IPC12_PMPIP_MASK                        0x1C000000
#define _IPC12_PMPIP_LENGTH                      0x00000003

#define _IPC12_w_POSITION                        0x00000000
#define _IPC12_w_MASK                            0xFFFFFFFF
#define _IPC12_w_LENGTH                          0x00000020

#define _IPC13_PMPEIS_POSITION                   0x00000000
#define _IPC13_PMPEIS_MASK                       0x00000003
#define _IPC13_PMPEIS_LENGTH                     0x00000002

#define _IPC13_PMPEIP_POSITION                   0x00000002
#define _IPC13_PMPEIP_MASK                       0x0000001C
#define _IPC13_PMPEIP_LENGTH                     0x00000003

#define _IPC13_SPI2EIS_POSITION                  0x00000008
#define _IPC13_SPI2EIS_MASK                      0x00000300
#define _IPC13_SPI2EIS_LENGTH                    0x00000002

#define _IPC13_SPI2EIP_POSITION                  0x0000000A
#define _IPC13_SPI2EIP_MASK                      0x00001C00
#define _IPC13_SPI2EIP_LENGTH                    0x00000003

#define _IPC13_SPI2RXIS_POSITION                 0x00000010
#define _IPC13_SPI2RXIS_MASK                     0x00030000
#define _IPC13_SPI2RXIS_LENGTH                   0x00000002

#define _IPC13_SPI2RXIP_POSITION                 0x00000012
#define _IPC13_SPI2RXIP_MASK                     0x001C0000
#define _IPC13_SPI2RXIP_LENGTH                   0x00000003

#define _IPC13_SPI2TXIS_POSITION                 0x00000018
#define _IPC13_SPI2TXIS_MASK                     0x03000000
#define _IPC13_SPI2TXIS_LENGTH                   0x00000002

#define _IPC13_SPI2TXIP_POSITION                 0x0000001A
#define _IPC13_SPI2TXIP_MASK                     0x1C000000
#define _IPC13_SPI2TXIP_LENGTH                   0x00000003

#define _IPC13_w_POSITION                        0x00000000
#define _IPC13_w_MASK                            0xFFFFFFFF
#define _IPC13_w_LENGTH                          0x00000020

#define _IPC14_U2EIS_POSITION                    0x00000000
#define _IPC14_U2EIS_MASK                        0x00000003
#define _IPC14_U2EIS_LENGTH                      0x00000002

#define _IPC14_U2EIP_POSITION                    0x00000002
#define _IPC14_U2EIP_MASK                        0x0000001C
#define _IPC14_U2EIP_LENGTH                      0x00000003

#define _IPC14_U2RXIS_POSITION                   0x00000008
#define _IPC14_U2RXIS_MASK                       0x00000300
#define _IPC14_U2RXIS_LENGTH                     0x00000002

#define _IPC14_U2RXIP_POSITION                   0x0000000A
#define _IPC14_U2RXIP_MASK                       0x00001C00
#define _IPC14_U2RXIP_LENGTH                     0x00000003

#define _IPC14_U2TXIS_POSITION                   0x00000010
#define _IPC14_U2TXIS_MASK                       0x00030000
#define _IPC14_U2TXIS_LENGTH                     0x00000002

#define _IPC14_U2TXIP_POSITION                   0x00000012
#define _IPC14_U2TXIP_MASK                       0x001C0000
#define _IPC14_U2TXIP_LENGTH                     0x00000003

#define _IPC14_I2C2BIS_POSITION                  0x00000018
#define _IPC14_I2C2BIS_MASK                      0x03000000
#define _IPC14_I2C2BIS_LENGTH                    0x00000002

#define _IPC14_I2C2BIP_POSITION                  0x0000001A
#define _IPC14_I2C2BIP_MASK                      0x1C000000
#define _IPC14_I2C2BIP_LENGTH                    0x00000003

#define _IPC14_w_POSITION                        0x00000000
#define _IPC14_w_MASK                            0xFFFFFFFF
#define _IPC14_w_LENGTH                          0x00000020

#define _IPC15_I2C2SIS_POSITION                  0x00000000
#define _IPC15_I2C2SIS_MASK                      0x00000003
#define _IPC15_I2C2SIS_LENGTH                    0x00000002

#define _IPC15_I2C2SIP_POSITION                  0x00000002
#define _IPC15_I2C2SIP_MASK                      0x0000001C
#define _IPC15_I2C2SIP_LENGTH                    0x00000003

#define _IPC15_I2C2MIS_POSITION                  0x00000008
#define _IPC15_I2C2MIS_MASK                      0x00000300
#define _IPC15_I2C2MIS_LENGTH                    0x00000002

#define _IPC15_I2C2MIP_POSITION                  0x0000000A
#define _IPC15_I2C2MIP_MASK                      0x00001C00
#define _IPC15_I2C2MIP_LENGTH                    0x00000003

#define _IPC15_U3EIS_POSITION                    0x00000010
#define _IPC15_U3EIS_MASK                        0x00030000
#define _IPC15_U3EIS_LENGTH                      0x00000002

#define _IPC15_U3EIP_POSITION                    0x00000012
#define _IPC15_U3EIP_MASK                        0x001C0000
#define _IPC15_U3EIP_LENGTH                      0x00000003

#define _IPC15_U3RXIS_POSITION                   0x00000018
#define _IPC15_U3RXIS_MASK                       0x03000000
#define _IPC15_U3RXIS_LENGTH                     0x00000002

#define _IPC15_U3RXIP_POSITION                   0x0000001A
#define _IPC15_U3RXIP_MASK                       0x1C000000
#define _IPC15_U3RXIP_LENGTH                     0x00000003

#define _IPC15_w_POSITION                        0x00000000
#define _IPC15_w_MASK                            0xFFFFFFFF
#define _IPC15_w_LENGTH                          0x00000020

#define _IPC16_U3TXIS_POSITION                   0x00000000
#define _IPC16_U3TXIS_MASK                       0x00000003
#define _IPC16_U3TXIS_LENGTH                     0x00000002

#define _IPC16_U3TXIP_POSITION                   0x00000002
#define _IPC16_U3TXIP_MASK                       0x0000001C
#define _IPC16_U3TXIP_LENGTH                     0x00000003

