Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpe100.h
#define _OC7CON_ON_POSITION                      0x0000000F
#define _OC7CON_ON_MASK                          0x00008000
#define _OC7CON_ON_LENGTH                        0x00000001

#define _OC7CON_OCM0_POSITION                    0x00000000
#define _OC7CON_OCM0_MASK                        0x00000001
#define _OC7CON_OCM0_LENGTH                      0x00000001

#define _OC7CON_OCM1_POSITION                    0x00000001
#define _OC7CON_OCM1_MASK                        0x00000002
#define _OC7CON_OCM1_LENGTH                      0x00000001

#define _OC7CON_OCM2_POSITION                    0x00000002
#define _OC7CON_OCM2_MASK                        0x00000004
#define _OC7CON_OCM2_LENGTH                      0x00000001

#define _OC7CON_OCSIDL_POSITION                  0x0000000D
#define _OC7CON_OCSIDL_MASK                      0x00002000
#define _OC7CON_OCSIDL_LENGTH                    0x00000001

#define _OC7CON_w_POSITION                       0x00000000
#define _OC7CON_w_MASK                           0xFFFFFFFF
#define _OC7CON_w_LENGTH                         0x00000020

#define _OC8CON_OCM_POSITION                     0x00000000
#define _OC8CON_OCM_MASK                         0x00000007
#define _OC8CON_OCM_LENGTH                       0x00000003

#define _OC8CON_OCTSEL_POSITION                  0x00000003
#define _OC8CON_OCTSEL_MASK                      0x00000008
#define _OC8CON_OCTSEL_LENGTH                    0x00000001

#define _OC8CON_OCFLT_POSITION                   0x00000004
#define _OC8CON_OCFLT_MASK                       0x00000010
#define _OC8CON_OCFLT_LENGTH                     0x00000001

#define _OC8CON_OC32_POSITION                    0x00000005
#define _OC8CON_OC32_MASK                        0x00000020
#define _OC8CON_OC32_LENGTH                      0x00000001

#define _OC8CON_SIDL_POSITION                    0x0000000D
#define _OC8CON_SIDL_MASK                        0x00002000
#define _OC8CON_SIDL_LENGTH                      0x00000001

#define _OC8CON_ON_POSITION                      0x0000000F
#define _OC8CON_ON_MASK                          0x00008000
#define _OC8CON_ON_LENGTH                        0x00000001

#define _OC8CON_OCM0_POSITION                    0x00000000
#define _OC8CON_OCM0_MASK                        0x00000001
#define _OC8CON_OCM0_LENGTH                      0x00000001

#define _OC8CON_OCM1_POSITION                    0x00000001
#define _OC8CON_OCM1_MASK                        0x00000002
#define _OC8CON_OCM1_LENGTH                      0x00000001

#define _OC8CON_OCM2_POSITION                    0x00000002
#define _OC8CON_OCM2_MASK                        0x00000004
#define _OC8CON_OCM2_LENGTH                      0x00000001

#define _OC8CON_OCSIDL_POSITION                  0x0000000D
#define _OC8CON_OCSIDL_MASK                      0x00002000
#define _OC8CON_OCSIDL_LENGTH                    0x00000001

#define _OC8CON_w_POSITION                       0x00000000
#define _OC8CON_w_MASK                           0xFFFFFFFF
#define _OC8CON_w_LENGTH                         0x00000020

#define _OC9CON_OCM_POSITION                     0x00000000
#define _OC9CON_OCM_MASK                         0x00000007
#define _OC9CON_OCM_LENGTH                       0x00000003

#define _OC9CON_OCTSEL_POSITION                  0x00000003
#define _OC9CON_OCTSEL_MASK                      0x00000008
#define _OC9CON_OCTSEL_LENGTH                    0x00000001

#define _OC9CON_OCFLT_POSITION                   0x00000004
#define _OC9CON_OCFLT_MASK                       0x00000010
#define _OC9CON_OCFLT_LENGTH                     0x00000001

#define _OC9CON_OC32_POSITION                    0x00000005
#define _OC9CON_OC32_MASK                        0x00000020
#define _OC9CON_OC32_LENGTH                      0x00000001

#define _OC9CON_SIDL_POSITION                    0x0000000D
#define _OC9CON_SIDL_MASK                        0x00002000
#define _OC9CON_SIDL_LENGTH                      0x00000001

#define _OC9CON_ON_POSITION                      0x0000000F
#define _OC9CON_ON_MASK                          0x00008000
#define _OC9CON_ON_LENGTH                        0x00000001

#define _OC9CON_OCM0_POSITION                    0x00000000
#define _OC9CON_OCM0_MASK                        0x00000001
#define _OC9CON_OCM0_LENGTH                      0x00000001

#define _OC9CON_OCM1_POSITION                    0x00000001
#define _OC9CON_OCM1_MASK                        0x00000002
#define _OC9CON_OCM1_LENGTH                      0x00000001

#define _OC9CON_OCM2_POSITION                    0x00000002
#define _OC9CON_OCM2_MASK                        0x00000004
#define _OC9CON_OCM2_LENGTH                      0x00000001

#define _OC9CON_OCSIDL_POSITION                  0x0000000D
#define _OC9CON_OCSIDL_MASK                      0x00002000
#define _OC9CON_OCSIDL_LENGTH                    0x00000001

#define _OC9CON_w_POSITION                       0x00000000
#define _OC9CON_w_MASK                           0xFFFFFFFF
#define _OC9CON_w_LENGTH                         0x00000020

#define _I2C1CON_SEN_POSITION                    0x00000000
#define _I2C1CON_SEN_MASK                        0x00000001
#define _I2C1CON_SEN_LENGTH                      0x00000001

#define _I2C1CON_RSEN_POSITION                   0x00000001
#define _I2C1CON_RSEN_MASK                       0x00000002
#define _I2C1CON_RSEN_LENGTH                     0x00000001

#define _I2C1CON_PEN_POSITION                    0x00000002
#define _I2C1CON_PEN_MASK                        0x00000004
#define _I2C1CON_PEN_LENGTH                      0x00000001

#define _I2C1CON_RCEN_POSITION                   0x00000003
#define _I2C1CON_RCEN_MASK                       0x00000008
#define _I2C1CON_RCEN_LENGTH                     0x00000001

#define _I2C1CON_ACKEN_POSITION                  0x00000004
#define _I2C1CON_ACKEN_MASK                      0x00000010
#define _I2C1CON_ACKEN_LENGTH                    0x00000001

#define _I2C1CON_ACKDT_POSITION                  0x00000005
#define _I2C1CON_ACKDT_MASK                      0x00000020
#define _I2C1CON_ACKDT_LENGTH                    0x00000001

