Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpe100.h
#define _C1FSTAT_FIFOIP0_POSITION                0x00000000
#define _C1FSTAT_FIFOIP0_MASK                    0x00000001
#define _C1FSTAT_FIFOIP0_LENGTH                  0x00000001

#define _C1FSTAT_FIFOIP1_POSITION                0x00000001
#define _C1FSTAT_FIFOIP1_MASK                    0x00000002
#define _C1FSTAT_FIFOIP1_LENGTH                  0x00000001

#define _C1FSTAT_FIFOIP2_POSITION                0x00000002
#define _C1FSTAT_FIFOIP2_MASK                    0x00000004
#define _C1FSTAT_FIFOIP2_LENGTH                  0x00000001

#define _C1FSTAT_FIFOIP3_POSITION                0x00000003
#define _C1FSTAT_FIFOIP3_MASK                    0x00000008
#define _C1FSTAT_FIFOIP3_LENGTH                  0x00000001

#define _C1FSTAT_FIFOIP4_POSITION                0x00000004
#define _C1FSTAT_FIFOIP4_MASK                    0x00000010
#define _C1FSTAT_FIFOIP4_LENGTH                  0x00000001

#define _C1FSTAT_FIFOIP5_POSITION                0x00000005
#define _C1FSTAT_FIFOIP5_MASK                    0x00000020
#define _C1FSTAT_FIFOIP5_LENGTH                  0x00000001

#define _C1FSTAT_FIFOIP6_POSITION                0x00000006
#define _C1FSTAT_FIFOIP6_MASK                    0x00000040
#define _C1FSTAT_FIFOIP6_LENGTH                  0x00000001

#define _C1FSTAT_FIFOIP7_POSITION                0x00000007
#define _C1FSTAT_FIFOIP7_MASK                    0x00000080
#define _C1FSTAT_FIFOIP7_LENGTH                  0x00000001

#define _C1FSTAT_FIFOIP8_POSITION                0x00000008
#define _C1FSTAT_FIFOIP8_MASK                    0x00000100
#define _C1FSTAT_FIFOIP8_LENGTH                  0x00000001

#define _C1FSTAT_FIFOIP9_POSITION                0x00000009
#define _C1FSTAT_FIFOIP9_MASK                    0x00000200
#define _C1FSTAT_FIFOIP9_LENGTH                  0x00000001

#define _C1FSTAT_FIFOIP10_POSITION               0x0000000A
#define _C1FSTAT_FIFOIP10_MASK                   0x00000400
#define _C1FSTAT_FIFOIP10_LENGTH                 0x00000001

#define _C1FSTAT_FIFOIP11_POSITION               0x0000000B
#define _C1FSTAT_FIFOIP11_MASK                   0x00000800
#define _C1FSTAT_FIFOIP11_LENGTH                 0x00000001

#define _C1FSTAT_FIFOIP12_POSITION               0x0000000C
#define _C1FSTAT_FIFOIP12_MASK                   0x00001000
#define _C1FSTAT_FIFOIP12_LENGTH                 0x00000001

#define _C1FSTAT_FIFOIP13_POSITION               0x0000000D
#define _C1FSTAT_FIFOIP13_MASK                   0x00002000
#define _C1FSTAT_FIFOIP13_LENGTH                 0x00000001

#define _C1FSTAT_FIFOIP14_POSITION               0x0000000E
#define _C1FSTAT_FIFOIP14_MASK                   0x00004000
#define _C1FSTAT_FIFOIP14_LENGTH                 0x00000001

#define _C1FSTAT_FIFOIP15_POSITION               0x0000000F
#define _C1FSTAT_FIFOIP15_MASK                   0x00008000
#define _C1FSTAT_FIFOIP15_LENGTH                 0x00000001

#define _C1FSTAT_w_POSITION                      0x00000000
#define _C1FSTAT_w_MASK                          0xFFFFFFFF
#define _C1FSTAT_w_LENGTH                        0x00000020

#define _C1RXOVF_RXOVF_POSITION                  0x00000000
#define _C1RXOVF_RXOVF_MASK                      0xFFFFFFFF
#define _C1RXOVF_RXOVF_LENGTH                    0x00000020

#define _C1RXOVF_RXOVF0_POSITION                 0x00000000
#define _C1RXOVF_RXOVF0_MASK                     0x00000001
#define _C1RXOVF_RXOVF0_LENGTH                   0x00000001

#define _C1RXOVF_RXOVF1_POSITION                 0x00000001
#define _C1RXOVF_RXOVF1_MASK                     0x00000002
#define _C1RXOVF_RXOVF1_LENGTH                   0x00000001

#define _C1RXOVF_RXOVF2_POSITION                 0x00000002
#define _C1RXOVF_RXOVF2_MASK                     0x00000004
#define _C1RXOVF_RXOVF2_LENGTH                   0x00000001

#define _C1RXOVF_RXOVF3_POSITION                 0x00000003
#define _C1RXOVF_RXOVF3_MASK                     0x00000008
#define _C1RXOVF_RXOVF3_LENGTH                   0x00000001

#define _C1RXOVF_RXOVF4_POSITION                 0x00000004
#define _C1RXOVF_RXOVF4_MASK                     0x00000010
#define _C1RXOVF_RXOVF4_LENGTH                   0x00000001

#define _C1RXOVF_RXOVF5_POSITION                 0x00000005
#define _C1RXOVF_RXOVF5_MASK                     0x00000020
#define _C1RXOVF_RXOVF5_LENGTH                   0x00000001

#define _C1RXOVF_RXOVF6_POSITION                 0x00000006
#define _C1RXOVF_RXOVF6_MASK                     0x00000040
#define _C1RXOVF_RXOVF6_LENGTH                   0x00000001

#define _C1RXOVF_RXOVF7_POSITION                 0x00000007
#define _C1RXOVF_RXOVF7_MASK                     0x00000080
#define _C1RXOVF_RXOVF7_LENGTH                   0x00000001

#define _C1RXOVF_RXOVF8_POSITION                 0x00000008
#define _C1RXOVF_RXOVF8_MASK                     0x00000100
#define _C1RXOVF_RXOVF8_LENGTH                   0x00000001

#define _C1RXOVF_RXOVF9_POSITION                 0x00000009
#define _C1RXOVF_RXOVF9_MASK                     0x00000200
#define _C1RXOVF_RXOVF9_LENGTH                   0x00000001

#define _C1RXOVF_RXOVF10_POSITION                0x0000000A
#define _C1RXOVF_RXOVF10_MASK                    0x00000400
#define _C1RXOVF_RXOVF10_LENGTH                  0x00000001

#define _C1RXOVF_RXOVF11_POSITION                0x0000000B
#define _C1RXOVF_RXOVF11_MASK                    0x00000800
#define _C1RXOVF_RXOVF11_LENGTH                  0x00000001

#define _C1RXOVF_RXOVF12_POSITION                0x0000000C
#define _C1RXOVF_RXOVF12_MASK                    0x00001000
#define _C1RXOVF_RXOVF12_LENGTH                  0x00000001

#define _C1RXOVF_RXOVF13_POSITION                0x0000000D
#define _C1RXOVF_RXOVF13_MASK                    0x00002000
#define _C1RXOVF_RXOVF13_LENGTH                  0x00000001

#define _C1RXOVF_RXOVF14_POSITION                0x0000000E
#define _C1RXOVF_RXOVF14_MASK                    0x00004000
#define _C1RXOVF_RXOVF14_LENGTH                  0x00000001

#define _C1RXOVF_RXOVF15_POSITION                0x0000000F
#define _C1RXOVF_RXOVF15_MASK                    0x00008000
#define _C1RXOVF_RXOVF15_LENGTH                  0x00000001

#define _C1RXOVF_w_POSITION                      0x00000000
#define _C1RXOVF_w_MASK                          0xFFFFFFFF
#define _C1RXOVF_w_LENGTH                        0x00000020

