Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpe100.h
#define _C3FIFOINT8_RXNEMPTYIF_POSITION          0x00000000
#define _C3FIFOINT8_RXNEMPTYIF_MASK              0x00000001
#define _C3FIFOINT8_RXNEMPTYIF_LENGTH            0x00000001

#define _C3FIFOINT8_RXHALFIF_POSITION            0x00000001
#define _C3FIFOINT8_RXHALFIF_MASK                0x00000002
#define _C3FIFOINT8_RXHALFIF_LENGTH              0x00000001

#define _C3FIFOINT8_RXFULLIF_POSITION            0x00000002
#define _C3FIFOINT8_RXFULLIF_MASK                0x00000004
#define _C3FIFOINT8_RXFULLIF_LENGTH              0x00000001

#define _C3FIFOINT8_RXOVFLIF_POSITION            0x00000003
#define _C3FIFOINT8_RXOVFLIF_MASK                0x00000008
#define _C3FIFOINT8_RXOVFLIF_LENGTH              0x00000001

#define _C3FIFOINT8_TXEMPTYIF_POSITION           0x00000008
#define _C3FIFOINT8_TXEMPTYIF_MASK               0x00000100
#define _C3FIFOINT8_TXEMPTYIF_LENGTH             0x00000001

#define _C3FIFOINT8_TXHALFIF_POSITION            0x00000009
#define _C3FIFOINT8_TXHALFIF_MASK                0x00000200
#define _C3FIFOINT8_TXHALFIF_LENGTH              0x00000001

#define _C3FIFOINT8_TXNFULLIF_POSITION           0x0000000A
#define _C3FIFOINT8_TXNFULLIF_MASK               0x00000400
#define _C3FIFOINT8_TXNFULLIF_LENGTH             0x00000001

#define _C3FIFOINT8_RXNEMPTYIE_POSITION          0x00000010
#define _C3FIFOINT8_RXNEMPTYIE_MASK              0x00010000
#define _C3FIFOINT8_RXNEMPTYIE_LENGTH            0x00000001

#define _C3FIFOINT8_RXHALFIE_POSITION            0x00000011
#define _C3FIFOINT8_RXHALFIE_MASK                0x00020000
#define _C3FIFOINT8_RXHALFIE_LENGTH              0x00000001

#define _C3FIFOINT8_RXFULLIE_POSITION            0x00000012
#define _C3FIFOINT8_RXFULLIE_MASK                0x00040000
#define _C3FIFOINT8_RXFULLIE_LENGTH              0x00000001

#define _C3FIFOINT8_RXOVFLIE_POSITION            0x00000013
#define _C3FIFOINT8_RXOVFLIE_MASK                0x00080000
#define _C3FIFOINT8_RXOVFLIE_LENGTH              0x00000001

#define _C3FIFOINT8_TXEMPTYIE_POSITION           0x00000018
#define _C3FIFOINT8_TXEMPTYIE_MASK               0x01000000
#define _C3FIFOINT8_TXEMPTYIE_LENGTH             0x00000001

#define _C3FIFOINT8_TXHALFIE_POSITION            0x00000019
#define _C3FIFOINT8_TXHALFIE_MASK                0x02000000
#define _C3FIFOINT8_TXHALFIE_LENGTH              0x00000001

#define _C3FIFOINT8_TXNFULLIE_POSITION           0x0000001A
#define _C3FIFOINT8_TXNFULLIE_MASK               0x04000000
#define _C3FIFOINT8_TXNFULLIE_LENGTH             0x00000001

#define _C3FIFOINT8_w_POSITION                   0x00000000
#define _C3FIFOINT8_w_MASK                       0xFFFFFFFF
#define _C3FIFOINT8_w_LENGTH                     0x00000020

#define _C3FIFOCI8_CFIFOCI_POSITION              0x00000000
#define _C3FIFOCI8_CFIFOCI_MASK                  0x0000001F
#define _C3FIFOCI8_CFIFOCI_LENGTH                0x00000005

#define _C3FIFOCI8_w_POSITION                    0x00000000
#define _C3FIFOCI8_w_MASK                        0xFFFFFFFF
#define _C3FIFOCI8_w_LENGTH                      0x00000020

#define _C3FIFOCON9_TXPRI_POSITION               0x00000000
#define _C3FIFOCON9_TXPRI_MASK                   0x00000003
#define _C3FIFOCON9_TXPRI_LENGTH                 0x00000002

#define _C3FIFOCON9_RTREN_POSITION               0x00000002
#define _C3FIFOCON9_RTREN_MASK                   0x00000004
#define _C3FIFOCON9_RTREN_LENGTH                 0x00000001

#define _C3FIFOCON9_TXREQ_POSITION               0x00000003
#define _C3FIFOCON9_TXREQ_MASK                   0x00000008
#define _C3FIFOCON9_TXREQ_LENGTH                 0x00000001

#define _C3FIFOCON9_TXERR_POSITION               0x00000004
#define _C3FIFOCON9_TXERR_MASK                   0x00000010
#define _C3FIFOCON9_TXERR_LENGTH                 0x00000001

#define _C3FIFOCON9_TXLARB_POSITION              0x00000005
#define _C3FIFOCON9_TXLARB_MASK                  0x00000020
#define _C3FIFOCON9_TXLARB_LENGTH                0x00000001

#define _C3FIFOCON9_TXABAT_POSITION              0x00000006
#define _C3FIFOCON9_TXABAT_MASK                  0x00000040
#define _C3FIFOCON9_TXABAT_LENGTH                0x00000001

#define _C3FIFOCON9_TXEN_POSITION                0x00000007
#define _C3FIFOCON9_TXEN_MASK                    0x00000080
#define _C3FIFOCON9_TXEN_LENGTH                  0x00000001

#define _C3FIFOCON9_DONLY_POSITION               0x0000000C
#define _C3FIFOCON9_DONLY_MASK                   0x00001000
#define _C3FIFOCON9_DONLY_LENGTH                 0x00000001

#define _C3FIFOCON9_UINC_POSITION                0x0000000D
#define _C3FIFOCON9_UINC_MASK                    0x00002000
#define _C3FIFOCON9_UINC_LENGTH                  0x00000001

#define _C3FIFOCON9_FRESET_POSITION              0x0000000E
#define _C3FIFOCON9_FRESET_MASK                  0x00004000
#define _C3FIFOCON9_FRESET_LENGTH                0x00000001

#define _C3FIFOCON9_FSIZE_POSITION               0x00000010
#define _C3FIFOCON9_FSIZE_MASK                   0x001F0000
#define _C3FIFOCON9_FSIZE_LENGTH                 0x00000005

#define _C3FIFOCON9_w_POSITION                   0x00000000
#define _C3FIFOCON9_w_MASK                       0xFFFFFFFF
#define _C3FIFOCON9_w_LENGTH                     0x00000020

#define _C3FIFOINT9_RXNEMPTYIF_POSITION          0x00000000
#define _C3FIFOINT9_RXNEMPTYIF_MASK              0x00000001
#define _C3FIFOINT9_RXNEMPTYIF_LENGTH            0x00000001

#define _C3FIFOINT9_RXHALFIF_POSITION            0x00000001
#define _C3FIFOINT9_RXHALFIF_MASK                0x00000002
#define _C3FIFOINT9_RXHALFIF_LENGTH              0x00000001

#define _C3FIFOINT9_RXFULLIF_POSITION            0x00000002
#define _C3FIFOINT9_RXFULLIF_MASK                0x00000004
#define _C3FIFOINT9_RXFULLIF_LENGTH              0x00000001

#define _C3FIFOINT9_RXOVFLIF_POSITION            0x00000003
#define _C3FIFOINT9_RXOVFLIF_MASK                0x00000008
#define _C3FIFOINT9_RXOVFLIF_LENGTH              0x00000001

#define _C3FIFOINT9_TXEMPTYIF_POSITION           0x00000008
#define _C3FIFOINT9_TXEMPTYIF_MASK               0x00000100
#define _C3FIFOINT9_TXEMPTYIF_LENGTH             0x00000001

#define _C3FIFOINT9_TXHALFIF_POSITION            0x00000009
#define _C3FIFOINT9_TXHALFIF_MASK                0x00000200
#define _C3FIFOINT9_TXHALFIF_LENGTH              0x00000001

#define _C3FIFOINT9_TXNFULLIF_POSITION           0x0000000A
#define _C3FIFOINT9_TXNFULLIF_MASK               0x00000400
#define _C3FIFOINT9_TXNFULLIF_LENGTH             0x00000001

