Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/include/proc/p32mk1024gpe100.h
#define _ADCTRGSNS_LVL2_POSITION                 0x00000002
#define _ADCTRGSNS_LVL2_MASK                     0x00000004
#define _ADCTRGSNS_LVL2_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL3_POSITION                 0x00000003
#define _ADCTRGSNS_LVL3_MASK                     0x00000008
#define _ADCTRGSNS_LVL3_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL4_POSITION                 0x00000004
#define _ADCTRGSNS_LVL4_MASK                     0x00000010
#define _ADCTRGSNS_LVL4_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL5_POSITION                 0x00000005
#define _ADCTRGSNS_LVL5_MASK                     0x00000020
#define _ADCTRGSNS_LVL5_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL6_POSITION                 0x00000006
#define _ADCTRGSNS_LVL6_MASK                     0x00000040
#define _ADCTRGSNS_LVL6_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL7_POSITION                 0x00000007
#define _ADCTRGSNS_LVL7_MASK                     0x00000080
#define _ADCTRGSNS_LVL7_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL8_POSITION                 0x00000008
#define _ADCTRGSNS_LVL8_MASK                     0x00000100
#define _ADCTRGSNS_LVL8_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL9_POSITION                 0x00000009
#define _ADCTRGSNS_LVL9_MASK                     0x00000200
#define _ADCTRGSNS_LVL9_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL10_POSITION                0x0000000A
#define _ADCTRGSNS_LVL10_MASK                    0x00000400
#define _ADCTRGSNS_LVL10_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL11_POSITION                0x0000000B
#define _ADCTRGSNS_LVL11_MASK                    0x00000800
#define _ADCTRGSNS_LVL11_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL12_POSITION                0x0000000C
#define _ADCTRGSNS_LVL12_MASK                    0x00001000
#define _ADCTRGSNS_LVL12_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL13_POSITION                0x0000000D
#define _ADCTRGSNS_LVL13_MASK                    0x00002000
#define _ADCTRGSNS_LVL13_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL14_POSITION                0x0000000E
#define _ADCTRGSNS_LVL14_MASK                    0x00004000
#define _ADCTRGSNS_LVL14_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL15_POSITION                0x0000000F
#define _ADCTRGSNS_LVL15_MASK                    0x00008000
#define _ADCTRGSNS_LVL15_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL16_POSITION                0x00000010
#define _ADCTRGSNS_LVL16_MASK                    0x00010000
#define _ADCTRGSNS_LVL16_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL17_POSITION                0x00000011
#define _ADCTRGSNS_LVL17_MASK                    0x00020000
#define _ADCTRGSNS_LVL17_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL18_POSITION                0x00000012
#define _ADCTRGSNS_LVL18_MASK                    0x00040000
#define _ADCTRGSNS_LVL18_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL19_POSITION                0x00000013
#define _ADCTRGSNS_LVL19_MASK                    0x00080000
#define _ADCTRGSNS_LVL19_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL20_POSITION                0x00000014
#define _ADCTRGSNS_LVL20_MASK                    0x00100000
#define _ADCTRGSNS_LVL20_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL21_POSITION                0x00000015
#define _ADCTRGSNS_LVL21_MASK                    0x00200000
#define _ADCTRGSNS_LVL21_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL22_POSITION                0x00000016
#define _ADCTRGSNS_LVL22_MASK                    0x00400000
#define _ADCTRGSNS_LVL22_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL23_POSITION                0x00000017
#define _ADCTRGSNS_LVL23_MASK                    0x00800000
#define _ADCTRGSNS_LVL23_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL24_POSITION                0x00000018
#define _ADCTRGSNS_LVL24_MASK                    0x01000000
#define _ADCTRGSNS_LVL24_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL25_POSITION                0x00000019
#define _ADCTRGSNS_LVL25_MASK                    0x02000000
#define _ADCTRGSNS_LVL25_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL26_POSITION                0x0000001A
#define _ADCTRGSNS_LVL26_MASK                    0x04000000
#define _ADCTRGSNS_LVL26_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL27_POSITION                0x0000001B
#define _ADCTRGSNS_LVL27_MASK                    0x08000000
#define _ADCTRGSNS_LVL27_LENGTH                  0x00000001

#define _ADC0TIME_SAMC_POSITION                  0x00000000
#define _ADC0TIME_SAMC_MASK                      0x000003FF
#define _ADC0TIME_SAMC_LENGTH                    0x0000000A

#define _ADC0TIME_ADCDIV_POSITION                0x00000010
#define _ADC0TIME_ADCDIV_MASK                    0x007F0000
#define _ADC0TIME_ADCDIV_LENGTH                  0x00000007

#define _ADC0TIME_BCHEN_POSITION                 0x00000017
#define _ADC0TIME_BCHEN_MASK                     0x00800000
#define _ADC0TIME_BCHEN_LENGTH                   0x00000001

#define _ADC0TIME_SELRES_POSITION                0x00000018
#define _ADC0TIME_SELRES_MASK                    0x03000000
#define _ADC0TIME_SELRES_LENGTH                  0x00000002

#define _ADC0TIME_ADCEIS_POSITION                0x0000001A
#define _ADC0TIME_ADCEIS_MASK                    0x1C000000
#define _ADC0TIME_ADCEIS_LENGTH                  0x00000003

#define _ADC1TIME_SAMC_POSITION                  0x00000000
#define _ADC1TIME_SAMC_MASK                      0x000003FF
#define _ADC1TIME_SAMC_LENGTH                    0x0000000A

#define _ADC1TIME_ADCDIV_POSITION                0x00000010
#define _ADC1TIME_ADCDIV_MASK                    0x007F0000
#define _ADC1TIME_ADCDIV_LENGTH                  0x00000007

#define _ADC1TIME_BCHEN_POSITION                 0x00000017
#define _ADC1TIME_BCHEN_MASK                     0x00800000
#define _ADC1TIME_BCHEN_LENGTH                   0x00000001

#define _ADC1TIME_SELRES_POSITION                0x00000018
#define _ADC1TIME_SELRES_MASK                    0x03000000
#define _ADC1TIME_SELRES_LENGTH                  0x00000002

#define _ADC1TIME_ADCEIS_POSITION                0x0000001A
#define _ADC1TIME_ADCEIS_MASK                    0x1C000000
#define _ADC1TIME_ADCEIS_LENGTH                  0x00000003

